witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_processor.c
#include "audio_processor.h"
#include "stm32f4xx_hal.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>
#include "arm_math.h"
#include "fpga.h"
#include "trx_manager.h"
#include "wm8731.h"
#include "functions.h"
#include "audio_filters.h"
#include "agc.h"
#include "settings.h"
#include "profiler.h"
#include "usbd_audio_if.h"
#include "noise_reduction.h"
#include "cw_decoder.h"

volatile uint32_t AUDIOPROC_samples = 0;
volatile uint32_t AUDIOPROC_TXA_samples = 0;
volatile uint32_t AUDIOPROC_TXB_samples = 0;
int32_t Processor_AudioBuffer_A[FPGA_AUDIO_BUFFER_SIZE] = { 0 };
int32_t Processor_AudioBuffer_B[FPGA_AUDIO_BUFFER_SIZE] = { 0 };
volatile uint8_t Processor_AudioBuffer_ReadyBuffer = 0;
volatile bool Processor_NeedRXBuffer = false;
volatile bool Processor_NeedTXBuffer = false;
float32_t FPGA_Audio_Buffer_Q_tmp[FPGA_AUDIO_BUFFER_HALF_SIZE] = { 0 };
float32_t FPGA_Audio_Buffer_I_tmp[FPGA_AUDIO_BUFFER_HALF_SIZE] = { 0 };
volatile float32_t Processor_AVG_amplitude = 0.0f; //средняя амплитуда семплов при прёме
volatile float32_t Processor_TX_MAX_amplitude_IN = 0.0f; //средняя амплитуда семплов при передаче (до процессора)
volatile float32_t Processor_TX_MAX_amplitude_OUT = 0.0f; //средняя амплитуда семплов при передаче (после процессора)
volatile float32_t Processor_RX_Audio_Samples_MAX_value = 0.0f; //максимальное значение семплов
volatile float32_t Processor_RX_Audio_Samples_MIN_value = 0.0f; //минимальное значение семплов
volatile float32_t ALC_need_gain = 1.0f;
volatile float32_t fm_sql_avg = 0.0f;
volatile float32_t Processor_selected_RFpower_amplitude = 0.0f;

static const uint16_t numBlocks = FPGA_AUDIO_BUFFER_HALF_SIZE / APROCESSOR_BLOCK_SIZE;
static float32_t ampl_val_i = 0.0f;
static float32_t ampl_val_q = 0.0f;
static float32_t ALC_need_gain_target = 1.0f;
static uint16_t block = 0;

static void doRX_LPF(void);
static void doRX_HPF(void);
static void doRX_DNR(void);
static void doRX_AGC(void);
static void doRX_NOTCH(void);
static void doRX_SMETER(void);
static void doRX_COPYCHANNEL(void);
static void doCW_Decode(void);
static void DemodulateFM(void);
static void ModulateFM(void);

void initAudioProcessor(void)
{
	InitAudioFilters();
	InitAGC();
}

void processRxAudio(void)
{
	if (!Processor_NeedRXBuffer) return;
	VFO* current_vfo = CurrentVFO();
	
	AUDIOPROC_samples++;
	uint16_t FPGA_Audio_Buffer_Index_tmp = FPGA_Audio_Buffer_Index;
	if (FPGA_Audio_Buffer_Index_tmp == 0)
		FPGA_Audio_Buffer_Index_tmp = FPGA_AUDIO_BUFFER_SIZE;
	else
		FPGA_Audio_Buffer_Index_tmp--;

	switch (TRX_getMode(current_vfo))
	{
	case TRX_MODE_IQ:
	case TRX_MODE_NFM:
	case TRX_MODE_WFM:
	case TRX_MODE_AM:
		readHalfFromCircleBuffer32((uint32_t *)&FPGA_Audio_Buffer_SPEC_Q[0], (uint32_t *)&FPGA_Audio_Buffer_Q_tmp[0], FPGA_Audio_Buffer_Index_tmp, FPGA_AUDIO_BUFFER_SIZE);
		readHalfFromCircleBuffer32((uint32_t *)&FPGA_Audio_Buffer_SPEC_I[0], (uint32_t *)&FPGA_Audio_Buffer_I_tmp[0], FPGA_Audio_Buffer_Index_tmp, FPGA_AUDIO_BUFFER_SIZE);
		break;
	default:
		readHalfFromCircleBuffer32((uint32_t *)&FPGA_Audio_Buffer_VOICE_Q[0], (uint32_t *)&FPGA_Audio_Buffer_Q_tmp[0], FPGA_Audio_Buffer_Index_tmp, FPGA_AUDIO_BUFFER_SIZE);
		readHalfFromCircleBuffer32((uint32_t *)&FPGA_Audio_Buffer_VOICE_I[0], (uint32_t *)&FPGA_Audio_Buffer_I_tmp[0], FPGA_Audio_Buffer_Index_tmp, FPGA_AUDIO_BUFFER_SIZE);
		break;
	}

	//Process DC corrector filter
	dc_filter(FPGA_Audio_Buffer_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, 0);
	dc_filter(FPGA_Audio_Buffer_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, 1);

	//RF Gain
	arm_scale_f32(FPGA_Audio_Buffer_I_tmp, TRX.RF_Gain, FPGA_Audio_Buffer_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
	arm_scale_f32(FPGA_Audio_Buffer_Q_tmp, TRX.RF_Gain, FPGA_Audio_Buffer_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);

	switch (TRX_getMode(current_vfo))
	{
	case TRX_MODE_LSB:
	case TRX_MODE_CW_L:
		doRX_HPF();
	case TRX_MODE_DIGI_L:
		doRX_LPF();
		arm_sub_f32((float32_t *)&FPGA_Audio_Buffer_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);   // difference of I and Q - LSB
		doRX_NOTCH();
		doRX_SMETER();
		doRX_DNR();
		doRX_AGC();
		doCW_Decode();
		doRX_COPYCHANNEL();
		break;
	case TRX_MODE_USB:
	case TRX_MODE_CW_U:
		doRX_HPF();
	case TRX_MODE_DIGI_U:
		doRX_LPF();
		arm_add_f32((float32_t *)&FPGA_Audio_Buffer_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);   // sum of I and Q - USB
		doRX_NOTCH();
		doRX_SMETER();
		doRX_DNR();
		doRX_AGC();
		doCW_Decode();
		doRX_COPYCHANNEL();
		break;
	case TRX_MODE_AM:
		doRX_LPF();
		arm_mult_f32((float32_t *)&FPGA_Audio_Buffer_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
		arm_mult_f32((float32_t *)&FPGA_Audio_Buffer_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
		arm_add_f32((float32_t *)&FPGA_Audio_Buffer_I_tmp[0], (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0], (float32_t *)&FPGA_Audio_Buffer_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
		for (int i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
			arm_sqrt_f32(FPGA_Audio_Buffer_I_tmp[i], &FPGA_Audio_Buffer_I_tmp[i]);
		doRX_NOTCH();
		doRX_SMETER();
		doRX_DNR();
		doRX_AGC();
		doRX_COPYCHANNEL();
		break;
	case TRX_MODE_NFM:
	case TRX_MODE_WFM:
		doRX_LPF();
		DemodulateFM();
		doRX_SMETER();
		doRX_DNR();
		doRX_AGC();
		doRX_COPYCHANNEL();
		break;
	case TRX_MODE_IQ:
	default:
		doRX_SMETER();
		break;
	}

	//OUT Volume
	arm_scale_f32(FPGA_Audio_Buffer_I_tmp, (float32_t)TRX.Volume / 100.0f, FPGA_Audio_Buffer_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
	arm_scale_f32(FPGA_Audio_Buffer_Q_tmp, (float32_t)TRX.Volume / 100.0f, FPGA_Audio_Buffer_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);

	//Prepare data to DMA
	if (Processor_AudioBuffer_ReadyBuffer == 0)
	{
		for (uint16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
		{
			Processor_AudioBuffer_B[i * 2] = FPGA_Audio_Buffer_I_tmp[i]; //left channel
			Processor_AudioBuffer_B[i * 2 + 1] = FPGA_Audio_Buffer_Q_tmp[i]; //right channel
		}
		Processor_AudioBuffer_ReadyBuffer = 1;
	}
	else
	{
		for (uint16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
		{
			Processor_AudioBuffer_A[i * 2] = FPGA_Audio_Buffer_I_tmp[i]; //left channel
			Processor_AudioBuffer_A[i * 2 + 1] = FPGA_Audio_Buffer_Q_tmp[i]; //right channel
		}
		Processor_AudioBuffer_ReadyBuffer = 0;
	}

	//Send to Codec DMA
	if (WM8731_DMA_state) //complete
	{
		if (Processor_AudioBuffer_ReadyBuffer == 0)
			HAL_DMA_Start_IT(&hdma_memtomem_dma2_stream0, (uint32_t)&Processor_AudioBuffer_A[0], (uint32_t)&CODEC_Audio_Buffer_RX[FPGA_AUDIO_BUFFER_SIZE], FPGA_AUDIO_BUFFER_SIZE);
		else
			HAL_DMA_Start_IT(&hdma_memtomem_dma2_stream0, (uint32_t)&Processor_AudioBuffer_B[0], (uint32_t)&CODEC_Audio_Buffer_RX[FPGA_AUDIO_BUFFER_SIZE], FPGA_AUDIO_BUFFER_SIZE);
		AUDIOPROC_TXA_samples++;
	}
	else //half
	{
		if (Processor_AudioBuffer_ReadyBuffer == 0)
			HAL_DMA_Start_IT(&hdma_memtomem_dma2_stream1, (uint32_t)&Processor_AudioBuffer_A[0], (uint32_t)&CODEC_Audio_Buffer_RX[0], FPGA_AUDIO_BUFFER_SIZE);
		else
			HAL_DMA_Start_IT(&hdma_memtomem_dma2_stream1, (uint32_t)&Processor_AudioBuffer_B[0], (uint32_t)&CODEC_Audio_Buffer_RX[0], FPGA_AUDIO_BUFFER_SIZE);
		AUDIOPROC_TXB_samples++;
	}

	//Send to USB Audio
	if (USB_AUDIO_need_rx_buffer)
	{
		if (Processor_AudioBuffer_ReadyBuffer == 0)
		{
			if (!USB_AUDIO_current_rx_buffer)
				for (uint16_t i = 0; i < (USB_AUDIO_RX_BUFFER_SIZE / 2); i++) USB_AUDIO_rx_buffer_a[i] = (int16_t)((int32_t)Processor_AudioBuffer_A[i] * (1.0f / TRX.Volume*100.0f));
			else
				for (uint16_t i = 0; i < (USB_AUDIO_RX_BUFFER_SIZE / 2); i++) USB_AUDIO_rx_buffer_b[i] = (int16_t)((int32_t)Processor_AudioBuffer_A[i] * (1.0f / TRX.Volume*100.0f));
		}
		else
		{
			if (!USB_AUDIO_current_rx_buffer)
				for (uint16_t i = 0; i < (USB_AUDIO_RX_BUFFER_SIZE / 2); i++) USB_AUDIO_rx_buffer_a[i] = (int16_t)((int32_t)Processor_AudioBuffer_B[i] * (1.0f / TRX.Volume*100.0f));
			else
				for (uint16_t i = 0; i < (USB_AUDIO_RX_BUFFER_SIZE / 2); i++) USB_AUDIO_rx_buffer_b[i] = (int16_t)((int32_t)Processor_AudioBuffer_B[i] * (1.0f / TRX.Volume*100.0f));
		}
		USB_AUDIO_need_rx_buffer = false;
	}
	//
	Processor_NeedRXBuffer = false;
}



void processTxAudio(void)
{
	if (!Processor_NeedTXBuffer) return;
	VFO* current_vfo = CurrentVFO();
	
	AUDIOPROC_samples++;
	Processor_selected_RFpower_amplitude = TRX.RF_Power / 100.0f * TRX_MAX_TX_Amplitude;
	uint8_t mode = TRX_getMode(current_vfo);

	if (TRX.InputType_USB) //USB AUDIO
	{
		uint16_t buffer_index = USB_AUDIO_GetTXBufferIndex_FS() / 2; //buffer 8bit, data 16 bit
		if ((buffer_index % 2) == 1) buffer_index--;
		readHalfFromCircleUSBBuffer((int16_t *)&USB_AUDIO_tx_buffer[0], (int32_t *)&Processor_AudioBuffer_A[0], buffer_index, USB_AUDIO_TX_BUFFER_SIZE / 2);
	}
	else //AUDIO CODEC AUDIO
	{
		uint16_t dma_index = __HAL_DMA_GET_COUNTER(hi2s3.hdmatx) / 2;
		if ((dma_index % 2) == 1) dma_index--;
		readHalfFromCircleBuffer32((uint32_t *)&CODEC_Audio_Buffer_TX[0], (uint32_t *)&Processor_AudioBuffer_A[0], dma_index, CODEC_AUDIO_BUFFER_SIZE);
	}

	//TUNE
	if (TRX_Tune)
	{
		for (uint16_t i = 0; i < FPGA_AUDIO_BUFFER_SIZE; i++)
		{
			//FPGA_Audio_SendBuffer_I[i] = (Processor_selected_RFpower_amplitude / 100 * TUNE_POWER) * arm_sin_f32(((float32_t)i / (float32_t)TRX_SAMPLERATE)*PI*2.0f*1.0f);
			//FPGA_Audio_SendBuffer_Q[i] = FPGA_Audio_SendBuffer_I[i];
			FPGA_Audio_SendBuffer_I[i] = Processor_selected_RFpower_amplitude / 100 * TUNE_POWER;
			FPGA_Audio_SendBuffer_Q[i] = Processor_selected_RFpower_amplitude / 100 * TUNE_POWER;
		}
		Processor_NeedTXBuffer = false;
		Processor_NeedRXBuffer = false;
		return;
	}
	
	for (uint16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
	{
		FPGA_Audio_Buffer_I_tmp[i] = (int16_t)(Processor_AudioBuffer_A[i * 2]);
		FPGA_Audio_Buffer_Q_tmp[i] = (int16_t)(Processor_AudioBuffer_A[i * 2 + 1]);
	}

	//Process DC corrector filter
	dc_filter(FPGA_Audio_Buffer_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, 2);
	dc_filter(FPGA_Audio_Buffer_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE, 3);

	if (mode != TRX_MODE_IQ)
	{
		//IIR HPF
		for (block = 0; block < numBlocks; block++)
			arm_iir_lattice_f32(&IIR_HPF_I, (float32_t *)&FPGA_Audio_Buffer_I_tmp[block*APROCESSOR_BLOCK_SIZE], (float32_t *)&FPGA_Audio_Buffer_I_tmp[block*APROCESSOR_BLOCK_SIZE], APROCESSOR_BLOCK_SIZE);
		//IIR LPF
		if (current_vfo->Filter_Width > 0)
			for (block = 0; block < numBlocks; block++)
				arm_iir_lattice_f32(&IIR_LPF_I, (float32_t *)&FPGA_Audio_Buffer_I_tmp[block*APROCESSOR_BLOCK_SIZE], (float32_t *)&FPGA_Audio_Buffer_I_tmp[block*APROCESSOR_BLOCK_SIZE], APROCESSOR_BLOCK_SIZE);
		memcpy(&FPGA_Audio_Buffer_Q_tmp[0], &FPGA_Audio_Buffer_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE * 4); //double left and right channel

