witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_processor.c
		//RF PowerControl (Audio Level Control) Compressor
		Processor_TX_MAX_amplitude_IN = 0;
		//ищем максимум в амплитуде
		for (uint16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
		{
			arm_abs_f32(&FPGA_Audio_Buffer_I_tmp[i], &ampl_val_i, 1);
			arm_abs_f32(&FPGA_Audio_Buffer_Q_tmp[i], &ampl_val_q, 1);
			if (ampl_val_i > Processor_TX_MAX_amplitude_IN) Processor_TX_MAX_amplitude_IN = ampl_val_i;
			if (ampl_val_q > Processor_TX_MAX_amplitude_IN) Processor_TX_MAX_amplitude_IN = ampl_val_q;
		}
		if (Processor_TX_MAX_amplitude_IN == 0.0f) Processor_TX_MAX_amplitude_IN = 0.001f;
		//расчитываем целевое значение усиления
		ALC_need_gain_target = Processor_selected_RFpower_amplitude / Processor_TX_MAX_amplitude_IN;
		//двигаем усиление на шаг
		if (ALC_need_gain_target > ALC_need_gain)
			ALC_need_gain += (ALC_need_gain_target - ALC_need_gain) / TX_AGC_STEPSIZE;
		else
			ALC_need_gain -= (ALC_need_gain - ALC_need_gain_target) / TX_AGC_STEPSIZE;

		if (ALC_need_gain_target < ALC_need_gain)
			ALC_need_gain = ALC_need_gain_target;
		if (ALC_need_gain < 0.0f) ALC_need_gain = 0.0f;
		//перегрузка (клиппинг), резко снижаем усиление
		if ((ALC_need_gain*Processor_TX_MAX_amplitude_IN) > (Processor_selected_RFpower_amplitude*1.1f))
			ALC_need_gain = ALC_need_gain_target;
		if (ALC_need_gain > TX_AGC_MAXGAIN) ALC_need_gain = TX_AGC_MAXGAIN;
		//шумовой порог
		if (Processor_TX_MAX_amplitude_IN < TX_AGC_NOISEGATE) ALC_need_gain = 0.0f;
		//оключаем усиление для некоторых видов мод
		if ((ALC_need_gain > 1.0f) && (mode == TRX_MODE_DIGI_L || mode == TRX_MODE_DIGI_U || mode == TRX_MODE_IQ || mode == TRX_MODE_LOOPBACK)) ALC_need_gain = 1.0f;
		if (TRX_Tune) ALC_need_gain = 1.0f;
		//применяем усиление
		arm_scale_f32(FPGA_Audio_Buffer_I_tmp, ALC_need_gain, FPGA_Audio_Buffer_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		arm_scale_f32(FPGA_Audio_Buffer_Q_tmp, ALC_need_gain, FPGA_Audio_Buffer_Q_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);
		//
		switch (mode)
		{
		case TRX_MODE_CW_L:
		case TRX_MODE_CW_U:
			if (!TRX_key_serial && !TRX_ptt_hard && !TRX_key_hard) Processor_selected_RFpower_amplitude = 0;
			for (uint16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
			{
				FPGA_Audio_Buffer_Q_tmp[i] = Processor_selected_RFpower_amplitude;
				FPGA_Audio_Buffer_I_tmp[i] = Processor_selected_RFpower_amplitude;
			}
			break;
		case TRX_MODE_USB:
		case TRX_MODE_DIGI_U:
			//hilbert fir
			for (block = 0; block < numBlocks; block++)
			{
				// + 45 deg to Q data
				arm_fir_f32(&FIR_TX_Hilbert_Q, (float32_t *)&FPGA_Audio_Buffer_I_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), (float32_t *)&FPGA_Audio_Buffer_I_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), APROCESSOR_BLOCK_SIZE);
				// - 45 deg to I data
				arm_fir_f32(&FIR_TX_Hilbert_I, (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), APROCESSOR_BLOCK_SIZE);
			}
			break;
		case TRX_MODE_LSB:
		case TRX_MODE_DIGI_L:
			//hilbert fir
			for (block = 0; block < numBlocks; block++)
			{
				// + 45 deg to I data
				arm_fir_f32(&FIR_TX_Hilbert_I, (float32_t *)&FPGA_Audio_Buffer_I_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), (float32_t *)&FPGA_Audio_Buffer_I_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), APROCESSOR_BLOCK_SIZE);
				// - 45 deg to Q data
				arm_fir_f32(&FIR_TX_Hilbert_Q, (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), APROCESSOR_BLOCK_SIZE);
			}
			break;
		case TRX_MODE_AM:
			for (block = 0; block < numBlocks; block++)
			{
				// + 45 deg to I data
				arm_fir_f32(&FIR_TX_Hilbert_I, (float32_t *)&FPGA_Audio_Buffer_I_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), (float32_t *)&FPGA_Audio_Buffer_I_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), APROCESSOR_BLOCK_SIZE);
				// - 45 deg to Q data
				arm_fir_f32(&FIR_TX_Hilbert_Q, (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), APROCESSOR_BLOCK_SIZE);
			}
			for (size_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
			{
				float32_t i_am = ((FPGA_Audio_Buffer_I_tmp[i] - FPGA_Audio_Buffer_Q_tmp[i]) + (Processor_selected_RFpower_amplitude)) / 2.0f;
				float32_t q_am = ((FPGA_Audio_Buffer_Q_tmp[i] - FPGA_Audio_Buffer_I_tmp[i]) - (Processor_selected_RFpower_amplitude)) / 2.0f;
				FPGA_Audio_Buffer_I_tmp[i] = i_am;
				FPGA_Audio_Buffer_Q_tmp[i] = q_am;
			}
			break;
		case TRX_MODE_NFM:
		case TRX_MODE_WFM:
			ModulateFM();
			break;
		default:
			break;
		}
	}

	//Send TX data to FFT
	for (uint16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
	{
		if (NeedFFTInputBuffer)
		{
			FFTInput_I[FFT_buff_index] = FPGA_Audio_Buffer_I_tmp[i];
			FFTInput_Q[FFT_buff_index] = FPGA_Audio_Buffer_Q_tmp[i];
			FFT_buff_index++;
			if (FFT_buff_index == FFT_SIZE)
			{
				FFT_buff_index = 0;
				NeedFFTInputBuffer = false;
				FFT_buffer_ready = true;
			}
		}
	}

	//Loopback mode
	if (mode == TRX_MODE_LOOPBACK)
	{
		//OUT Volume
		arm_scale_f32(FPGA_Audio_Buffer_I_tmp, (float32_t)TRX.Volume / 50.0f, FPGA_Audio_Buffer_I_tmp, FPGA_AUDIO_BUFFER_HALF_SIZE);

		for (uint16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
		{
			Processor_AudioBuffer_A[i * 2] = FPGA_Audio_Buffer_I_tmp[i]; //left channel 
			Processor_AudioBuffer_A[i * 2 + 1] = Processor_AudioBuffer_A[i * 2]; //right channel 
		}

		if (WM8731_DMA_state) //compleate
		{
			HAL_DMA_Start(&hdma_memtomem_dma2_stream0, (uint32_t)&Processor_AudioBuffer_A[0], (uint32_t)&CODEC_Audio_Buffer_RX[FPGA_AUDIO_BUFFER_SIZE], FPGA_AUDIO_BUFFER_SIZE);
			HAL_DMA_PollForTransfer(&hdma_memtomem_dma2_stream0, HAL_DMA_FULL_TRANSFER, HAL_MAX_DELAY);
			AUDIOPROC_TXA_samples++;
		}
		else //half
		{
			HAL_DMA_Start(&hdma_memtomem_dma2_stream1, (uint32_t)&Processor_AudioBuffer_A[0], (uint32_t)&CODEC_Audio_Buffer_RX[0], FPGA_AUDIO_BUFFER_SIZE);
			HAL_DMA_PollForTransfer(&hdma_memtomem_dma2_stream1, HAL_DMA_FULL_TRANSFER, HAL_MAX_DELAY);
			AUDIOPROC_TXB_samples++;
		}
	}
	else
	{
		//CW SelfHear
		if (TRX.CW_SelfHear && (TRX_key_serial || TRX_key_hard) && (mode == TRX_MODE_CW_L || mode == TRX_MODE_CW_U))
		{
			for (uint16_t i = 0; i < CODEC_AUDIO_BUFFER_SIZE; i++)
				CODEC_Audio_Buffer_RX[i] = ((float32_t)TRX.Volume / 100.0f)*2000.0f*arm_sin_f32(((float32_t)i / (float32_t)TRX_SAMPLERATE)*PI*2.0f*(float32_t)TRX.CW_GENERATOR_SHIFT_HZ);
		}
		//
		if (FPGA_Audio_Buffer_State) //Send to FPGA DMA
		{
			AUDIOPROC_TXA_samples++;
			HAL_DMA_Start(&hdma_memtomem_dma2_stream0, (uint32_t)&FPGA_Audio_Buffer_I_tmp[0], (uint32_t)&FPGA_Audio_SendBuffer_I[FPGA_AUDIO_BUFFER_HALF_SIZE], FPGA_AUDIO_BUFFER_HALF_SIZE);
			HAL_DMA_PollForTransfer(&hdma_memtomem_dma2_stream0, HAL_DMA_FULL_TRANSFER, HAL_MAX_DELAY);
			HAL_DMA_Start(&hdma_memtomem_dma2_stream0, (uint32_t)&FPGA_Audio_Buffer_Q_tmp[0], (uint32_t)&FPGA_Audio_SendBuffer_Q[FPGA_AUDIO_BUFFER_HALF_SIZE], FPGA_AUDIO_BUFFER_HALF_SIZE);
			HAL_DMA_PollForTransfer(&hdma_memtomem_dma2_stream0, HAL_DMA_FULL_TRANSFER, HAL_MAX_DELAY);
		}
		else
		{
			AUDIOPROC_TXB_samples++;
			HAL_DMA_Start(&hdma_memtomem_dma2_stream1, (uint32_t)&FPGA_Audio_Buffer_I_tmp[0], (uint32_t)&FPGA_Audio_SendBuffer_I[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
			HAL_DMA_PollForTransfer(&hdma_memtomem_dma2_stream1, HAL_DMA_FULL_TRANSFER, HAL_MAX_DELAY);
			HAL_DMA_Start(&hdma_memtomem_dma2_stream1, (uint32_t)&FPGA_Audio_Buffer_Q_tmp[0], (uint32_t)&FPGA_Audio_SendBuffer_Q[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
			HAL_DMA_PollForTransfer(&hdma_memtomem_dma2_stream1, HAL_DMA_FULL_TRANSFER, HAL_MAX_DELAY);
		}
	}
	
	Processor_TX_MAX_amplitude_OUT = 0;
	//ищем максимум в амплитуде
	for (uint16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
	{
		arm_abs_f32(&FPGA_Audio_Buffer_I_tmp[i], &ampl_val_i, 1);
		arm_abs_f32(&FPGA_Audio_Buffer_Q_tmp[i], &ampl_val_q, 1);
		if (ampl_val_i > Processor_TX_MAX_amplitude_OUT) Processor_TX_MAX_amplitude_OUT = ampl_val_i;
		if (ampl_val_q > Processor_TX_MAX_amplitude_OUT) Processor_TX_MAX_amplitude_OUT = ampl_val_q;
	}
	
	Processor_NeedTXBuffer = false;
	Processor_NeedRXBuffer = false;
}

static void doCW_Decode(void)
{
	//CW Decoder
	if (TRX.CWDecoder && (TRX_getMode(CurrentVFO()) == TRX_MODE_CW_L || TRX_getMode(CurrentVFO()) == TRX_MODE_CW_U))
		for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / CWDECODER_SAMPLES); block++)
			CWDecoder_Process((float32_t *)&FPGA_Audio_Buffer_I_tmp[0] + (block*CWDECODER_SAMPLES));
}

static void doRX_LPF(void)
{
	//IIR LPF
	if (CurrentVFO()->Filter_Width > 0)
		for (block = 0; block < numBlocks; block++)
		{
			arm_iir_lattice_f32(&IIR_LPF_I, (float32_t *)&FPGA_Audio_Buffer_I_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), (float32_t *)&FPGA_Audio_Buffer_I_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), APROCESSOR_BLOCK_SIZE);
			arm_iir_lattice_f32(&IIR_LPF_Q, (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), (float32_t *)&FPGA_Audio_Buffer_Q_tmp[0] + (block*APROCESSOR_BLOCK_SIZE), APROCESSOR_BLOCK_SIZE);
		}
}

static void doRX_HPF(void)
{
	//IIR HPF
	for (block = 0; block < numBlocks; block++)
	{
		arm_iir_lattice_f32(&IIR_HPF_I, (float32_t *)&FPGA_Audio_Buffer_I_tmp[block*APROCESSOR_BLOCK_SIZE], (float32_t *)&FPGA_Audio_Buffer_I_tmp[block*APROCESSOR_BLOCK_SIZE], APROCESSOR_BLOCK_SIZE);
		arm_iir_lattice_f32(&IIR_HPF_Q, (float32_t *)&FPGA_Audio_Buffer_Q_tmp[block*APROCESSOR_BLOCK_SIZE], (float32_t *)&FPGA_Audio_Buffer_Q_tmp[block*APROCESSOR_BLOCK_SIZE], APROCESSOR_BLOCK_SIZE);
	}
}

static void doRX_NOTCH(void)
{
	if (TRX.NotchFilter)
	{
		for (block = 0; block < numBlocks; block++)
			arm_biquad_cascade_df2T_f32(&NOTCH_FILTER, (float32_t *)&FPGA_Audio_Buffer_I_tmp[block*APROCESSOR_BLOCK_SIZE], (float32_t *)&FPGA_Audio_Buffer_I_tmp[block*APROCESSOR_BLOCK_SIZE], APROCESSOR_BLOCK_SIZE);
	}
}

static void doRX_DNR(void)
{
	//Digital Noise Reduction
	if (TRX.DNR > 0)
	{
		for (block = 0; block < (FPGA_AUDIO_BUFFER_HALF_SIZE / NOISE_REDUCTION_BLOCK_SIZE); block++)
			processNoiseReduction((float32_t *)&FPGA_Audio_Buffer_I_tmp[0] + (block*NOISE_REDUCTION_BLOCK_SIZE), (float32_t *)&FPGA_Audio_Buffer_I_tmp[0] + (block*NOISE_REDUCTION_BLOCK_SIZE));
	}
}

static void doRX_AGC(void)
{
	//AGC
	DoAGC((float32_t *)&FPGA_Audio_Buffer_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
}

static void doRX_SMETER(void)
{
	//Prepare data to calculate s-meter
	for (uint16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
	{
		if (FPGA_Audio_Buffer_I_tmp[i] > Processor_RX_Audio_Samples_MAX_value) Processor_RX_Audio_Samples_MAX_value = FPGA_Audio_Buffer_I_tmp[i];
		if (FPGA_Audio_Buffer_Q_tmp[i] > Processor_RX_Audio_Samples_MAX_value) Processor_RX_Audio_Samples_MAX_value = FPGA_Audio_Buffer_Q_tmp[i];
		if (FPGA_Audio_Buffer_I_tmp[i] < Processor_RX_Audio_Samples_MIN_value) Processor_RX_Audio_Samples_MIN_value = FPGA_Audio_Buffer_I_tmp[i];
		if (FPGA_Audio_Buffer_Q_tmp[i] < Processor_RX_Audio_Samples_MIN_value) Processor_RX_Audio_Samples_MIN_value = FPGA_Audio_Buffer_Q_tmp[i];
	}
}

static void doRX_COPYCHANNEL(void)
{
	//Double channel I->Q
	dma_memcpy32((uint32_t)&FPGA_Audio_Buffer_Q_tmp[0], (uint32_t)&FPGA_Audio_Buffer_I_tmp[0], FPGA_AUDIO_BUFFER_HALF_SIZE);
}

static void DemodulateFM(void)
{
	float32_t angle, x, y, a, b;
	static float lpf_prev, hpf_prev_a, hpf_prev_b;// used in FM detection and low/high pass processing
	float32_t squelch_buf[FPGA_AUDIO_BUFFER_HALF_SIZE];
	static float32_t i_prev, q_prev;// used in FM detection and low/high pass processing
	static uint8_t fm_sql_count = 0;// used for squelch processing and debouncing tone detection, respectively

	for (uint16_t i = 0; i < FPGA_AUDIO_BUFFER_HALF_SIZE; i++)
	{
		// first, calculate "x" and "y" for the arctan2, comparing the vectors of present data with previous data
		y = (FPGA_Audio_Buffer_Q_tmp[i] * i_prev) - (FPGA_Audio_Buffer_I_tmp[i] * q_prev);
		x = (FPGA_Audio_Buffer_I_tmp[i] * i_prev) + (FPGA_Audio_Buffer_Q_tmp[i] * q_prev);
		angle = atan2f(y, x);

